WebServiceRequests/MaintainQuoteRequests/SaveQuote.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ver="http://version6_6.services.view.jdquote.deere.com">
   <soapenv:Header/>
   <soapenv:Body>
      <ver:saveQuote>
         <quoteData>
            <quoteID>?</quoteID>
            <quoteStatusId>?</quoteStatusId>
            <salesPerson>?</salesPerson>
            <leadDealerId>?</leadDealerId>
            <locationId>?</locationId>
            <quoteCurrency>?</quoteCurrency>
            <closedLostReason>?</closedLostReason>
            <closedLostMakeId>?</closedLostMakeId>
            <lastModifiedDate>?</lastModifiedDate>
            <customerData>
               <customerBusinessName>JOE C &amp; MARIE E HEARL</customerBusinessName>
               <customerPhone>0006288517</customerPhone>
               <customerFirstName>?</customerFirstName>
               <customerLastName>?</customerLastName>
               <customerAddr1>RR 3 BOX 222B</customerAddr1>
               <customerAddr2>?</customerAddr2>
               <customerCity>ABINGDON</customerCity>
               <customerCountry>?</customerCountry>
               <customerCounty>US</customerCounty>
               <customerEmail>?</customerEmail>
               <customerFax>?</customerFax>
               <customerState>VA</customerState>
               <customerZipCode>24210</customerZipCode>
               <customerCommLocID>?</customerCommLocID>
               <customerCommTypeID>?</customerCommTypeID>
               <customerCompEntityId>0</customerCompEntityId>
               <customerEntityId>102136198</customerEntityId>
               <customerBusinessPhoneNumber>?</customerBusinessPhoneNumber>
               <customerHomePhoneNumber>?</customerHomePhoneNumber>
               <errorMessage>
                  <errorId>?</errorId>
                  <errorMessage>?</errorMessage>
               </errorMessage>
            </customerData>
            <!--Zero or more repetitions:-->
            <equipmentData>
               <equipmentID>?</equipmentID>
               <costPrice>?</costPrice>
               <listPrice>?</listPrice>
               <includeInRecapProposal>?</includeInRecapProposal>
               <equipNotes>?</equipNotes>
               <equipSourceId>?</equipSourceId>
               <customerLatestMachMakeID>?</customerLatestMachMakeID>
               <DBSPartsNumber>?</DBSPartsNumber>
               <!--Zero or more repetitions:-->
               <equipmentOptionData>
                  <optionCode>?</optionCode>
                  <optionCostAmount>?</optionCostAmount>
                  <optionDesc>?</optionDesc>
                  <optionPriceAmount>?</optionPriceAmount>
                  <optionType>?</optionType>
               </equipmentOptionData>
               <!--Zero or more repetitions:-->
               <attachmentData>
                  <attachmentID>?</attachmentID>
                  <attachmentCode>?</attachmentCode>
                  <attachmentType>?</attachmentType>
                  <attachmentDescription>?</attachmentDescription>
                  <costPrice>?</costPrice>
                  <listtPrice>?</listtPrice>
                  <errorMessage>
                     <errorId>?</errorId>
                     <errorMessage>?</errorMessage>
                  </errorMessage>
               </attachmentData>
               <equipType>?</equipType>
               <hourMeterReading>?</hourMeterReading>
               <serialNo>?</serialNo>
               <yearOfManufacture>?</yearOfManufacture>
               <dealerOrderNumber>?</dealerOrderNumber>
               <dealerStockNumber>75168</dealerStockNumber>
               <canadianCalculationId>?</canadianCalculationId>
               <canadianBonusPercentage>?</canadianBonusPercentage>
               <canadianCPAorCAPercentage>?</canadianCPAorCAPercentage>
               <!--Zero or more repetitions:-->
               <adjustmentData>
                  <costPrice>1000</costPrice>
                  <description>Adjustment</description>
                  <listPrice>1500</listPrice>
                  <errorMessage>
                     <errorId>?</errorId>
                     <errorMessage>?</errorMessage>
                  </errorMessage>
               </adjustmentData>
               <categoryID>?</categoryID>
               <dealerSpecifiedModel>?</dealerSpecifiedModel>
               <makeID>?</makeID>
               <modelID>?</modelID>
               <subCategoryID>?</subCategoryID>
               <pciModel>?</pciModel>
               <errorMessage>
                  <errorId>?</errorId>
                  <errorMessage>?</errorMessage>
               </errorMessage>
            </equipmentData>
            <expirationDate>12/28/2014</expirationDate>
            <quoteName>SaveQuote_CA_AG_DBS_NEW</quoteName>
            <!--Zero or more repetitions:-->
            <tradeInEquipmentData>
               <tradeInID>?</tradeInID>
               <allowance>?</allowance>
               <description>JOHN DEERE 4500 TRACTOR</description>
               <hourMeterReading>100</hourMeterReading>
               <serialNo>?</serialNo>
               <yearOfManufacture>2012</yearOfManufacture>
               <categoryID>1012</categoryID>
               <dealerSpecifiedModel>?</dealerSpecifiedModel>
               <makeID>1</makeID>
               <modelID>5348</modelID>
               <subCategoryID>1073</subCategoryID>
               <netTradeValue>5000</netTradeValue>
               <errorMessage>
                  <errorId>?</errorId>
                  <errorMessage>?</errorMessage>
               </errorMessage>
            </tradeInEquipmentData>
            <dealerRacfId>XBG1524</dealerRacfId>
            <quoteType>2</quoteType>
            <dbsStockNumber>?</dbsStockNumber>
            <equipmentToBeAddedFromDBS>?</equipmentToBeAddedFromDBS>
            <custNotes>?</custNotes>
            <errorMessage>
               <errorId>?</errorId>
               <errorMessage>?</errorMessage>
            </errorMessage>
         </quoteData>
      </ver:saveQuote>
   </soapenv:Body>
</soapenv:Envelope>